БухЭксп/InformationRegisters/CW_ЗначенияЛогистическихСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗначенияЛогистическихСтатусовОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогистическийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЛогистическиеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСтатуса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыЛогистическихСтатусов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_МеханизмыРаскраскиСписковМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_МеханизмыРаскраскиСписковМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРаскрашивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныеЦвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦветаСтатусов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЛогистическиеСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЛогистическиеСтатусы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЦвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКартинки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыплненияУсловияДляПодчиненныхГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыплненияУсловияДляПодчиненныхЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_ЛогистическиеСтатусыСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Объект = Форма.Объект;
	
	мДоступныеТипы = Метаданные.ОпределяемыеТипы.CW_ОбъектыЛогистическихСтатусов.Тип.Типы();
	Если мДоступныеТипы.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанынеСтатуса = ПолучитьДанныеЛогистическогоСтатуса(Объект.Ссылка);
	
	Форма.ЛогистическийСтатус  = ДанынеСтатуса.ЛогистическийСтатус;
	Форма.Элементы.ЛогистическийСтатус.СписокВыбора.Добавить(ДанынеСтатуса.ЛогистическийСтатус,,,ДанынеСтатуса.Оформление.Картинка);
	
КонецПроцедуры

Процедура ПриСозданииФормыСпискаНаСервере(Форма, ИмяТаблицыФормы, ИдентификаторОбъекта, МеханизмРаскраски, Отказ, СтандартнаяОбработка) Экспорт
	
	СкрыватьКартинкиСтатусов = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(), "СкрыватьКартинкиСтатусовВЖурналах");
	Форма.Элементы.КартинкаСтатуса.Видимость = НЕ СкрыватьКартинкиСтатусов;
	
	УстановитьУсловноеОфрмлениеСтатусов(Форма.УсловноеОформление, ИмяТаблицыФормы, ИдентификаторОбъекта, МеханизмРаскраски);
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма) Экспорт
	
	Объект = Форма.Объект;

	ДанныеСтатуса = ПолучитьДанныеЛогистическогоСтатуса(Объект.Ссылка);
	
	Форма.ЛогистическийСтатус  = ДанныеСтатуса.ЛогистическийСтатус;
	Форма.Элементы.ЛогистическийСтатус.СписокВыбора.Добавить(ДанныеСтатуса.ЛогистическийСтатус,,,ДанныеСтатуса.Оформление.Картинка);
	
КонецПроцедуры



Процедура УстановитьУсловноеОфрмлениеСтатусов(УсловноеОформление, ИмяТаблицыФормы, ИдентификаторОбъекта, МеханизмРаскраски) Экспорт
	
	Если МеханизмРаскраски <> ПредопределенноеЗначение("Перечисление.CW_МеханизмыРаскраскиСписковМониторинга.ЦветаСтатусов") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ЛогистическиеСтатусы.ХранилищеЦвета КАК ХранилищеЦвета
	               |ИЗ
	               |	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
	               |ГДЕ
	               |	CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИдентификаторОбъекта";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЦветФона = Выборка.ХранилищеЦвета.Получить();
		Если ЦветФона = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.ИдентификаторПользовательскойНастройки = Строка("ЛОГИСТИЧЕСКИЕ_СТАТУСЫ");
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицыФормы);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ИмяТаблицыФормы+".ЛогистическийСтатус");
		ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение 	= Выборка.Ссылка;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЛогистическиеСтатусыДоступныДляОбъкта(ТипОбъекта) Экспорт
	
	Возврат	Метаданные.ОпределяемыеТипы.CW_ОбъектыЛогистическихСтатусов.Тип.СодержитТип(ТипОбъекта);
	
КонецФункции

Функция ПолучитьДоступныеТипыПоОпциям() Экспорт
	
	Результат = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок") Тогда
		Результат.Добавить(Тип("СправочникСсылка.CW_Грузоперевозки"));
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыЗаказов") Тогда
		Результат.Добавить(Тип("СправочникСсылка.CW_Заказы"));
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыЗаявок") Тогда
		Результат.Добавить(Тип("СправочникСсылка.CW_Заявки"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ОпределитьЛогистическийСтатусОбъекта(ИдентификаторОбъекта) Экспорт
	
	СоответствиеНеопредленногоСтатуса = Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеНеопредленногоСтатуса();
	СтатусНеопределен = СоответствиеНеопредленногоСтатуса.Получить(ТипЗнч(ИдентификаторОбъекта));
	
	СоответствиеМакетов = Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеИмениМакетаТипуЗначения();
	МакетОтбора 		= СоответствиеМакетов.Получить(ТипЗнч(ИдентификаторОбъекта));
	
	Если МакетОтбора = Неопределено Тогда
		Возврат СтатусНеопределен;
	КонецЕсли;

	КонтрольноеКоличествоСтрокПеревозок	= 1;
	КонтрольноеКоличествоСтрокЗакзаов	= 1;
	
	ПрименятьУсловиеГрузоперевозок	= ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Заказы") ИЛИ ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Заявки");
	
	Если ПрименятьУсловиеГрузоперевозок Тогда
		
		СоответствиеИмениРеквизитаТипуЗначения = ПолучитьСоответствиеИмениРеквизитаТипуЗначения(); 
		ИмяРеквизита = СоответствиеИмениРеквизитаТипуЗначения.Получить(ТипЗнч(ИдентификаторОбъекта));
		
	 	КонтрольноеКоличествоСтрокПеревозок = ПолучитьКоличествоГрузоперевозокПоЗаказуЗаявке(ИдентификаторОбъекта, ИмяРеквизита);
	КонецЕсли;
	
	ПрименятьУсловиеЗаказов	= ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Заявки");
	
	Если ПрименятьУсловиеЗаказов Тогда
	 	КонтрольноеКоличествоСтрокЗакзаов = ПолучитьКоличествоЗаказовПоЗаявке(ИдентификаторОбъекта);
	КонецЕсли;
	
	
	ИндентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ИдентификаторОбъекта));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛогистическиеСтатусы.Код КАК Код,
	               |	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ЛогистическиеСтатусы.ХранилищеОтбора КАК ХранилищеОтбора,
	               |	CW_ЛогистическиеСтатусы.ВариантВыплненияУсловияДляПодчиненныхЗаказов КАК ВариантУсловияЗаказов,
	               |	CW_ЛогистическиеСтатусы.ВариантВыплненияУсловияДляПодчиненныхГрузоперевозок КАК ВариантУсловияГрузоперевозок,
	               |	CW_ЛогистическиеСтатусы.Предопределенный КАК Предопределенный
	               |ИЗ
	               |	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
	               |ГДЕ
	               |	CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИндентификаторОбъекта
	               |	И CW_ЛогистическиеСтатусы.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ИндентификаторОбъекта", ИндентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПрименятьУсловиеГрузоперевозок 	= ?(Выборка.Предопределенный, Ложь, ПрименятьУсловиеГрузоперевозок);
		ПрименятьУсловиеЗаказов 		= ?(Выборка.Предопределенный, Ложь, ПрименятьУсловиеЗаказов);
		
		ПараметрыСтатуса = Новый Структура;
		ПараметрыСтатуса.Вставить("ИдентификаторОбъекта",			ИдентификаторОбъекта);
		ПараметрыСтатуса.Вставить("ИмяМакета",						МакетОтбора);
		ПараметрыСтатуса.Вставить("ХранилищеОтбора", 				Выборка.ХранилищеОтбора);
		
		ПараметрыСтатуса.Вставить("КоличествоСтрокПеревозок",		КонтрольноеКоличествоСтрокПеревозок);
		ПараметрыСтатуса.Вставить("КоличествоСтрокЗакзаов",			КонтрольноеКоличествоСтрокЗакзаов);
		
		ПараметрыСтатуса.Вставить("ВариантУсловияГрузоперевозок", 	Выборка.ВариантУсловияГрузоперевозок);
		ПараметрыСтатуса.Вставить("ВариантУсловияЗаказов", 			Выборка.ВариантУсловияЗаказов);
		
		ПараметрыСтатуса.Вставить("ПрименятьУсловиеГрузоперевозок",	ПрименятьУсловиеГрузоперевозок);
		ПараметрыСтатуса.Вставить("ПрименятьУсловиеЗаказов",		ПрименятьУсловиеЗаказов);
		
		Успешно = ПроверитьУсловияСтатуса(ПараметрыСтатуса);
		
		Если Успешно Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтатусНеопределен;
	
КонецФункции

Функция ПолучитьСоответствиеИмениРеквизитаТипуЗначения()
	
	Результат = новый Соответствие;
	Результат.Вставить(Тип("СправочникСсылка.CW_Заказы"),"Заказ");
	Результат.Вставить(Тип("СправочникСсылка.CW_Заявки"),"Заявка");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеЛогистическогоСтатуса(ОбъектСтатуса) Экспорт
	
	СоответствиеПервогоСтатуса 	= Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеНеопредленногоСтатуса();
	ПервыйСтатус 				= СоответствиеПервогоСтатуса.Получить(ТипЗнч(ОбъектСтатуса));
	
	Оформление 		= ПолучитьОформлениеСтатуса(ПервыйСтатус);
	ДанныеСтатуса	= Новый Структура("ЛогистическийСтатус,Оформление", ПервыйСтатус, Оформление);
	
	Если ОбъектСтатуса.Пустая() Тогда
		Возврат ДанныеСтатуса;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЗначенияЛогистическихСтатусовОбъектов.ОбъектСтатуса КАК ОбъектСтатуса,
	               |	CW_ЗначенияЛогистическихСтатусовОбъектов.ЛогистическийСтатус КАК ЛогистическийСтатус
	               |ИЗ
	               |	РегистрСведений.CW_ЗначенияЛогистическихСтатусовОбъектов КАК CW_ЗначенияЛогистическихСтатусовОбъектов
	               |ГДЕ
	               |	CW_ЗначенияЛогистическихСтатусовОбъектов.ОбъектСтатуса = &ОбъектСтатуса";
	
	Запрос.УстановитьПараметр("ОбъектСтатуса", ОбъектСтатуса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		Оформление 		= ПолучитьОформлениеСтатуса(Выборка.ЛогистическийСтатус);
	   	ДанныеСтатуса	= Новый Структура("ЛогистическийСтатус,Оформление", Выборка.ЛогистическийСтатус, Оформление);

	КонецЕсли;
	
	Возврат ДанныеСтатуса;
	
КонецФункции

Функция ПолучитьОформлениеСтатуса(ЛогистическийСтатус) Экспорт
	
	Цвет 			= ЛогистическийСтатус.ХранилищеЦвета.Получить();
	ДанныеКартинки 	= ЛогистическийСтатус.ХранилищеКартинки.Получить();
	Картинка 		= Новый Картинка(ДанныеКартинки);

	Оформление 		= Новый Структура("Цвет,Картинка", Цвет, Картинка);
	
	Возврат Оформление;

КонецФункции

Функция ПроверитьУсловияСтатуса(ПараметрыСтатуса)
	
	НастройкиСтатуса 		= ПараметрыСтатуса.ХранилищеОтбора.Получить();
	
	СхемаКомпоновкиДанных 	= Справочники.CW_ЛогистическиеСтатусы.ПолучитьМакет(ПараметрыСтатуса.ИмяМакета);
	Настройки 				= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Если НастройкиСтатуса <> Неопределено Тогда
		_УФС.СкопироватьОтбор(НастройкиСтатуса.Отбор, Настройки.Отбор);
	КонецЕсли;
	
	ЭлементОтбора 					= Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ПараметрыСтатуса.ИдентификаторОбъекта;
	ЭлементОтбора.Использование	 	= Истина;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если Результат.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УсловиеГрузоперевозокВыполнено 	= Истина;
	УсловиеЗаказовВыполнено 		= Истина;
	
	СтрокаТаблицы = Результат[0]; 
	
	Если ПараметрыСтатуса.ПрименятьУсловиеГрузоперевозок Тогда 
		Если ПараметрыСтатуса.ВариантУсловияГрузоперевозок = 2 Тогда
			УсловиеГрузоперевозокВыполнено = СтрокаТаблицы.Грузоперевозка > 0;
		ИначеЕсли ПараметрыСтатуса.ВариантУсловияГрузоперевозок = 1 Тогда
			УсловиеГрузоперевозокВыполнено = СтрокаТаблицы.Грузоперевозка = ПараметрыСтатуса.КоличествоСтрокПеревозок;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыСтатуса.ПрименятьУсловиеЗаказов Тогда
		Если ПараметрыСтатуса.ВариантУсловияЗаказов = 2 Тогда
			УсловиеЗаказовВыполнено = СтрокаТаблицы.Заказ > 0;
		ИначеЕсли ПараметрыСтатуса.ВариантУсловияЗаказов = 1 Тогда
			УсловиеЗаказовВыполнено = СтрокаТаблицы.Заказ = ПараметрыСтатуса.КоличествоСтрокЗакзаов;
		КонецЕсли;
	КонецЕсли;
	
	Возврат УсловиеГрузоперевозокВыполнено И УсловиеЗаказовВыполнено;
	
КонецФункции

Функция ПолучитьКоличествоГрузоперевозокПоЗаказуЗаявке(Ссылка, ИмяРеквизита)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_Грузоперевозки.Ссылка) КАК Количество
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки."+ИмяРеквизита+" = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	//Если грузоперевозок нет, то возвращаем 1, так как в исходном запрсоа по статусам в этом случае будет одна строка
	Возврат 1;  
	
КонецФункции

Функция ПолучитьКоличествоЗаказовПоЗаявке(Ссылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_Заказы.Ссылка) КАК Количество
	               |ИЗ
	               |	Справочник.CW_Заказы КАК CW_Заказы
	               |ГДЕ
	               |	CW_Заказы.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	//Если грузоперевозок нет, то возвращаем 1, так как в исходном запрсоа по статусам в этом случае будет одна строка
	Возврат 1;  
	
КонецФункции

Функция ПолучитьРасчетПоДатеДляТипаОбъекта()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"), 	Константы.CW_РассчитыватьЛогистическийСтатусГрузоперевозкиПоНаиболшейКонтрольнойДате.Получить());
	Результат.Вставить(Тип("СправочникСсылка.CW_Заказы"), 			Константы.CW_РассчитыватьЛогистическийСтатусЗаказаПоНаиболшейКонтрольнойДате.Получить());
	Результат.Вставить(Тип("СправочникСсылка.CW_Заявки"), 			Константы.CW_РассчитыватьЛогистическийСтатусЗявкиПоНаиболшейКонтрольнойДате.Получить());
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьЛогистическийСтатусОбъекта(ИдентификаторОбъекта) Экспорт
	
	СоответствиеРасчетПоДате = ПолучитьРасчетПоДатеДляТипаОбъекта();
	
	ТребуетсяРасчетПоДате = СоответствиеРасчетПоДате.Получить(ТипЗнч(ИдентификаторОбъекта));
	Если ТребуетсяРасчетПоДате Тогда
		ЛогистическийСтатус = ОпределитьЛогистическийСтатусОбъектаПоМаксимальнойДате(ИдентификаторОбъекта);
	Иначе
		ЛогистическийСтатус = ОпределитьЛогистическийСтатусОбъекта(ИдентификаторОбъекта);
	КонецЕсли;
	
	//Запишем данные в регистр
	РегистрыСведений.CW_ЗначенияЛогистическихСтатусовОбъектов.ЗаписатьЛогистическийСтатусОбъекта(ИдентификаторОбъекта, ЛогистическийСтатус);
	
КонецФункции

Функция ОпределитьЛогистическийСтатусОбъектаПоМаксимальнойДате(ИдентификаторОбъекта)
	
	СоответствиеНеопредленногоСтатуса 	= Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеНеопредленногоСтатуса();
	СтатусНеопределен 					= СоответствиеНеопредленногоСтатуса.Получить(ТипЗнч(ИдентификаторОбъекта));
	ИдентификаторОбъектаМетаданных 		= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ИдентификаторОбъекта));  
	
	//Определяем статус
	Запрос = Новый Запрос;   
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛогистическиеСтатусы.Ссылка КАК Статус,
	               |	CW_ЛогистическиеСтатусы.КонтрольнаяДата КАК Параметр
	               |ПОМЕСТИТЬ ВТ_СоответствияСтатусов
	               |ИЗ
	               |	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
	               |ГДЕ
	               |	CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИдентификаторОбъектаМетаданных
	               |	И CW_ЛогистическиеСтатусы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных",	ИдентификаторОбъектаМетаданных);
	Запрос.Выполнить(); 
	
	Если ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_СоответствияСтатусов.Статус КАК Статус,
		|	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
		|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
		|	CW_ХарактеристикиГрузоперевозок.ЗначениеФакт КАК ЗначениеФакт
		|ИЗ
		|	ВТ_СоответствияСтатусов КАК ВТ_СоответствияСтатусов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
		|		ПО ВТ_СоответствияСтатусов.Параметр = CW_ХарактеристикиГрузоперевозок.Параметр
		|			И (CW_ХарактеристикиГрузоперевозок.Грузоперевозка = &ОбъектПараметров)
		|ГДЕ
		|	CW_ХарактеристикиГрузоперевозок.ЗначениеФакт <> &ПустаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеФакт УБЫВ,
		|	ВТ_СоответствияСтатусов.Статус.Код УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";        
		
	КонецЕсли;
	
	Если ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Заявки") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_СоответствияСтатусов.Статус КАК Статус,
		|	CW_ХарактеристикиЗаявок.Параметр КАК Параметр,
		|	CW_ХарактеристикиЗаявок.Заявка КАК Заявка,
		|	CW_ХарактеристикиЗаявок.ЗначениеФакт КАК ЗначениеФакт
		|ИЗ
		|	ВТ_СоответствияСтатусов КАК ВТ_СоответствияСтатусов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиЗаявок КАК CW_ХарактеристикиЗаявок
		|		ПО ВТ_СоответствияСтатусов.Параметр = CW_ХарактеристикиЗаявок.Параметр
		|			И (CW_ХарактеристикиЗаявок.Заявка = &ОбъектПараметров)
		|ГДЕ
		|	CW_ХарактеристикиЗаявок.ЗначениеФакт <> &ПустаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеФакт УБЫВ,
		|	ВТ_СоответствияСтатусов.Статус.Код УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";        
		
	КонецЕсли;    
	
	Если ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Заказы") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_СоответствияСтатусов.Статус КАК Статус,
		|	CW_ХарактеристикиЗаказов.Параметр КАК Параметр,
		|	CW_ХарактеристикиЗаказов.Заказ КАК Заказ,
		|	CW_ХарактеристикиЗаказов.ЗначениеФакт КАК ЗначениеФакт
		|ИЗ
		|	ВТ_СоответствияСтатусов КАК ВТ_СоответствияСтатусов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
		|		ПО ВТ_СоответствияСтатусов.Параметр = CW_ХарактеристикиЗаказов.Параметр
		|			И (CW_ХарактеристикиЗаказов.Заказ = &ОбъектПараметров)
		|ГДЕ
		|	CW_ХарактеристикиЗаказов.ЗначениеФакт <> &ПустаяДата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеФакт УБЫВ,
		|	ВТ_СоответствияСтатусов.Статус.Код УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";        
		
	КонецЕсли;    
	
	Запрос.УстановитьПараметр("ОбъектПараметров", 				ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("ПустаяДата", 					Дата(1,1,1));
	
	РезультатЗапрос = Запрос.Выполнить();
	Выборка = РезультатЗапрос.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Статус) Тогда
			ТекущийСтатус = ПроверитьУсловиеЛогистическогоСтатусаПоДате(ИдентификаторОбъекта, Выборка.Статус);
			Если ТекущийСтатус <> Неопределено Тогда
				Возврат ТекущийСтатус;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтатусНеопределен;

КонецФункции

Функция ПроверитьУсловиеЛогистическогоСтатусаПоДате(ИдентификаторОбъекта, Статус)
	
	СоответствиеНеопредленногоСтатуса = Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеНеопредленногоСтатуса();
	СтатусНеопределен = СоответствиеНеопредленногоСтатуса.Получить(ТипЗнч(ИдентификаторОбъекта));
	
	СоответствиеМакетов = Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеИмениМакетаТипуЗначения();
	МакетОтбора 		= СоответствиеМакетов.Получить(ТипЗнч(ИдентификаторОбъекта));
	
	Если МакетОтбора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	КонтрольноеКоличествоСтрокПеревозок	= 1;
	КонтрольноеКоличествоСтрокЗакзаов	= 1;
	
	ПрименятьУсловиеГрузоперевозок	= ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Заказы") ИЛИ ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Заявки");
	
	Если ПрименятьУсловиеГрузоперевозок Тогда
		
		СоответствиеИмениРеквизитаТипуЗначения = ПолучитьСоответствиеИмениРеквизитаТипуЗначения(); 
		ИмяРеквизита = СоответствиеИмениРеквизитаТипуЗначения.Получить(ТипЗнч(ИдентификаторОбъекта));
		
	 	КонтрольноеКоличествоСтрокПеревозок = ПолучитьКоличествоГрузоперевозокПоЗаказуЗаявке(ИдентификаторОбъекта, ИмяРеквизита);
	КонецЕсли;
	
	ПрименятьУсловиеЗаказов	= ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Заявки");
	
	Если ПрименятьУсловиеЗаказов Тогда
	 	КонтрольноеКоличествоСтрокЗакзаов = ПолучитьКоличествоЗаказовПоЗаявке(ИдентификаторОбъекта);
	КонецЕсли;
	
	ИндентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ИдентификаторОбъекта));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛогистическиеСтатусы.Код КАК Код,
	               |	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ЛогистическиеСтатусы.ХранилищеОтбора КАК ХранилищеОтбора,
	               |	CW_ЛогистическиеСтатусы.ВариантВыплненияУсловияДляПодчиненныхЗаказов КАК ВариантУсловияЗаказов,
	               |	CW_ЛогистическиеСтатусы.ВариантВыплненияУсловияДляПодчиненныхГрузоперевозок КАК ВариантУсловияГрузоперевозок,
	               |	CW_ЛогистическиеСтатусы.Предопределенный КАК Предопределенный
	               |ИЗ
	               |	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
	               |ГДЕ
	               |	CW_ЛогистическиеСтатусы.Ссылка = &Ссылка
	               |	И CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИндентификаторОбъекта
	               |	И CW_ЛогистическиеСтатусы.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка",		 			Статус);
	Запрос.УстановитьПараметр("ИндентификаторОбъекта", 	ИндентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПрименятьУсловиеГрузоперевозок 	= ?(Выборка.Предопределенный, Ложь, ПрименятьУсловиеГрузоперевозок);
		ПрименятьУсловиеЗаказов 		= ?(Выборка.Предопределенный, Ложь, ПрименятьУсловиеЗаказов);
		
		ПараметрыСтатуса = Новый Структура;
		ПараметрыСтатуса.Вставить("ИдентификаторОбъекта",			ИдентификаторОбъекта);
		ПараметрыСтатуса.Вставить("ИмяМакета",						МакетОтбора);
		ПараметрыСтатуса.Вставить("ХранилищеОтбора", 				Выборка.ХранилищеОтбора);
		
		ПараметрыСтатуса.Вставить("КоличествоСтрокПеревозок",		КонтрольноеКоличествоСтрокПеревозок);
		ПараметрыСтатуса.Вставить("КоличествоСтрокЗакзаов",			КонтрольноеКоличествоСтрокЗакзаов);
		
		ПараметрыСтатуса.Вставить("ВариантУсловияГрузоперевозок", 	Выборка.ВариантУсловияГрузоперевозок);
		ПараметрыСтатуса.Вставить("ВариантУсловияЗаказов", 			Выборка.ВариантУсловияЗаказов);
		
		ПараметрыСтатуса.Вставить("ПрименятьУсловиеГрузоперевозок",	ПрименятьУсловиеГрузоперевозок);
		ПараметрыСтатуса.Вставить("ПрименятьУсловиеЗаказов",		ПрименятьУсловиеЗаказов);
		
		Успешно = ПроверитьУсловияСтатуса(ПараметрыСтатуса);
		
		Если Успешно Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаписатьЛогистическийСтатусОбъектов(СтруктураПараметров, АдресРезультат = Неопределено) Экспорт
	
	Для Каждого СсылкаВМассиве из СтруктураПараметров.МассивСсылок Цикл
		ЗаписатьЛогистическийСтатусОбъекта(СсылкаВМассиве);
	КонецЦикла;
	
КонецПроцедуры

//УСТАРЕЛА
Процедура РасчитатьЛогистическийСтатус(ИсходныйМассив, РасчитыватьСтатусСвзанныхОбъектов = Истина) Экспорт
	
	РассчитатьЛогистическийСтатус(ИсходныйМассив, РасчитыватьСтатусСвзанныхОбъектов);
	
КонецПроцедуры


Процедура РассчитатьЛогистическийСтатус(ИсходныйМассив, РасчитыватьСтатусСвзанныхОбъектов = Истина) Экспорт
	
	МассивДляРасчета = ПолучитьМассивДоступныхОбъектовДляРасчета(ИсходныйМассив);
	Если МассивДляРасчета.Количество() > 0 Тогда
		ПараметрыПроцедуры = Новый Структура;
		ПараметрыПроцедуры.Вставить("МассивСсылок", МассивДляРасчета);
		
		CW_ЛогистическиеСтатусыСервер.ЗаписатьЛогистическийСтатусОбъектов(ПараметрыПроцедуры);
	КонецЕсли;
	
	Если РасчитыватьСтатусСвзанныхОбъектов Тогда
		РассчитатьЛогистическийСтатусСвязанныхОбъектовВФоне(ИсходныйМассив);	
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьЛогистическийСтатусСвязанныхОбъектовВФоне(ИсходныйМассив)
	
	ДоступныеТипыПоОпциям 	= ПолучитьДоступныеТипыПоОпциям();

	МассивСсылок = КритерииОтбора.CW_ОбъектыРасчетаСтатусов.ПолучитьМассивСсылокДляРасчетаСтатусов(ИсходныйМассив, ДоступныеТипыПоОпциям);
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МассивСсылок", МассивСсылок);
	
	мПараметрыПроцедуры = Новый Массив;
	мПараметрыПроцедуры.Добавить(ПараметрыПроцедуры);
	
	ФоновыеЗадания.Выполнить("CW_ЛогистическиеСтатусыСервер.ЗаписатьЛогистическийСтатусОбъектов", мПараметрыПроцедуры, , "Расчет логистических статусов");

КонецПроцедуры

Функция ПолучитьМассивДоступныхОбъектовДляРасчета(Знач МассивСсылок)
	
	Результат = Новый Массив;
	
	ДоступныеТипыПоОпциям = ПолучитьДоступныеТипыПоОпциям();
	
	Для Каждого СсылкаВМассиве из МассивСсылок Цикл
		Если CW_ЛогистическиеСтатусыСервер.ЛогистическиеСтатусыДоступныДляОбъкта(ТипЗнч(СсылкаВМассиве)) 
			И ДоступныеТипыПоОпциям.Найти(ТипЗнч(СсылкаВМассиве)) <> Неопределено Тогда
			Результат.Добавить(СсылкаВМассиве);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//--
Функция ПолучитьОпциюИспользованияЛогистическихСтатусов(ИмяТипаОбъекта) Экспорт
	
	Если ИмяТипаОбъекта = "CW_Грузоперевозки" Тогда
		Возврат ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок");
	КонецЕсли;
	Если ИмяТипаОбъекта = "CW_Заказы" Тогда
		Возврат ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыЗаказов");
	КонецЕсли;
	Если ИмяТипаОбъекта = "CW_Заявки" Тогда
		Возврат ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыЗаявок");
	КонецЕсли;
	
КонецФункции
